
{
  "puzzles": [
    {
      "id": 1,
      "category": "Puzzle (Hard Logic)",
      "problem": "You have 12 identical-looking balls. One is slightly heavier or lighter. You can use a balance scale only 3 times. How do you find the odd one and know if it’s heavier or lighter?",
      "expert_answer": "Divide into groups of 4. Weigh 4 vs 4. If equal → odd is in remaining 4. Split further and test. Using elimination in 3 weighings, you identify the odd ball and whether it’s heavier/lighter."
    },
    {
      "id": 2,
      "category": "Aptitude (Probability)",
      "problem": "Two dice are rolled. What is the probability that the sum is either 7 or 11?",
      "expert_answer": "Total outcomes = 36. Sum = 7 → (6 outcomes). Sum = 11 → (2 outcomes). Probability = 8/36 = 2/9."
    },
    {
      "id": 3,
      "category": "Logical Reasoning (Hard)",
      "problem": "A says: “B always lies.” B says: “C always lies.” C says: “A and B are lying.” Who is telling the truth?",
      "expert_answer": "C is telling the truth. If C is right, then A and B are lying. A lies → B doesn’t always lie. B lies → C doesn’t always lie. Consistency holds only if C is truthful."
    },
    {
      "id": 4,
      "category": "Interview Question (Deep)",
      "problem": "“How would you handle failure if your dream project collapses?”",
      "expert_answer": "Show resilience: “I’d analyze root causes, learn from mistakes, and apply insights to future work. Failure is data for growth.”"
    },
    {
      "id": 5,
      "category": "Real-Life Problem (Ethical Dilemma)",
      "problem": "You discover a colleague is leaking confidential company data. What do you do?",
      "expert_answer": "Protect integrity: Document evidence, escalate to HR/management discreetly, avoid confrontation directly."
    },
    {
      "id": 6,
      "category": "Puzzle (Hard Math)",
      "problem": "A clock shows 3:15. What is the angle between the hour and minute hands?",
      "expert_answer": "At 3:15, minute hand at 90°. Hour hand = 3 × 30 + 7.5 = 97.5°. Difference = 7.5°."
    },
    {
      "id": 7,
      "category": "Aptitude (Combinatorics)",
      "problem": "How many ways can you arrange the letters of the word “SUCCESS”?",
      "expert_answer": "7! / (3! × 2! × 1! × 1!) = 420."
    },
    {
      "id": 8,
      "category": "Workplace Critical Thinking",
      "problem": "Your boss gives an impossible deadline. What do you do?",
      "expert_answer": "Clarify scope, propose realistic alternatives, break down deliverables, and suggest phased delivery."
    },
    {
      "id": 9,
      "category": "Deep Riddle",
      "problem": "I’m always in front of you but can never be seen. What am I?",
      "expert_answer": "The future."
    },
    {
      "id": 10,
      "category": "Logical Puzzle (Hard)",
      "problem": "You are in a prison with 2 doors and 2 guards. One door leads to freedom, the other to death. One guard always lies, one always tells the truth. You can ask only 1 question. What do you ask?",
      "expert_answer": "Ask either guard: “If I ask the other guard which door leads to freedom, which door will he point to?” Then choose the opposite door."
    },
    {
      "id": 11,
      "category": "Aptitude (Series)",
      "problem": "2, 6, 12, 20, 30, ?",
      "expert_answer": "Pattern = n² + n → 2 (1²+1), 6 (2²+2), 12 (3²+3), 20 (4²+4), 30 (5²+5). Next = 42 (6²+6)."
    },
    {
      "id": 12,
      "category": "Interview Question (Leadership)",
      "problem": "“If your team disagrees with you unanimously, what would you do?”",
      "expert_answer": "Listen, validate perspectives, test assumptions with data, and adapt if team’s reasoning is stronger."
    },
    {
      "id": 13,
      "category": "Real-Life Problem (Tough Choice)",
      "problem": "You get two job offers: one high-paying but stressful, another low-paying but growth-oriented. Which do you choose?",
      "expert_answer": "Align with long-term vision. If stability needed, take higher pay. If career growth is priority, choose learning path."
    },
    {
      "id": 14,
      "category": "Math Puzzle (Advanced)",
      "problem": "A man has two ropes, each takes 60 minutes to burn but burns unevenly. How to measure exactly 45 minutes?",
      "expert_answer": "Burn Rope A both ends + Rope B one end → Rope A finishes in 30 mins. Then light Rope B other end → finishes in 15 mins. Total = 45 mins."
    },
    {
      "id": 15,
      "category": "Logical Puzzle (Hard)",
      "problem": "100 prisoners are in a line. Each wears a red or blue hat, sees hats in front but not own. They must guess their hat color in order to survive. What’s the best strategy?",
      "expert_answer": "Use parity strategy: First prisoner announces color based on parity of visible hats. Each following prisoner deduces own hat using prior answers + visible hats."
    },
    {
      "id": 16,
      "category": "Aptitude (Probability)",
      "problem": "A coin is tossed until heads appears. What is the expected number of tosses?",
      "expert_answer": "Expectation = 1/p = 1/0.5 = 2."
    },
    {
      "id": 17,
      "category": "Interview Question (Deep Behavioral)",
      "problem": "“Tell me about the hardest decision you’ve made in your life.”",
      "expert_answer": "Use STAR method. Example: Choosing between career paths, balancing risk vs stability, final decision based on values and long-term goals."
    },
    {
      "id": 18,
      "category": "Puzzle (Numbers)",
      "problem": "Find two numbers that multiply to 36 but add to 13.",
      "expert_answer": "Numbers = 9 and 4."
    },
    {
      "id": 19,
      "category": "Workplace Scenario",
      "problem": "You’re asked to lead a team in a technology you don’t know. What do you do?",
      "expert_answer": "Quickly upskill, leverage experts in team, facilitate collaboration, and focus on leadership rather than technical micromanagement."
    },
    {
      "id": 20,
      "category": "Deep Riddle",
      "problem": "What disappears the moment you say its name?",
      "expert_answer": "Silence."
    },
    {
      "id": 21,
      "category": "Aptitude (Hard Algebra)",
      "problem": "If x + 1/x = 5, find x² + 1/x².",
      "expert_answer": "(x + 1/x)² = 25 → x² + 1/x² + 2 = 25 → x² + 1/x² = 23."
    },
    {
      "id": 22,
      "category": "Interview Case Study",
      "problem": "“If you were CEO of a failing startup, how would you save it?”",
      "expert_answer": "Diagnose core issues (finance, product, market fit). Pivot product if needed, cut costs, re-engage customers, seek strategic partnerships."
    },
    {
      "id": 23,
      "category": "Real-Life Ethical Problem",
      "problem": "You find out your friend cheated in an interview but got selected. Do you report it?",
      "expert_answer": "Weigh ethics vs loyalty. If company integrity is harmed, report anonymously."
    },
    {
      "id": 24,
      "category": "Puzzle (Chessboard Math)",
      "problem": "A chessboard has 64 squares. How many total squares of all sizes are there?",
      "expert_answer": "1² + 2² + 3² … + 8² = 204 squares."
    },
    {
      "id": 25,
      "category": "Logical Reasoning (Tough)",
      "problem": "Three switches are outside a room with 3 bulbs inside. You can only enter the room once. How do you identify which switch controls which bulb?",
      "expert_answer": "Turn on Switch 1 for 5 mins → turn it off. Turn Switch 2 on → enter room. Warm bulb = Switch 1, lit bulb = Switch 2, cold bulb = Switch 3."
    },
    {
      "id": 26,
      "category": "Aptitude (Speed/Distance)",
      "problem": "A boat goes 20 km downstream in 2 hours, and the same distance upstream in 4 hours. Find speed of boat in still water.",
      "expert_answer": "Downstream = 10 km/h, upstream = 5 km/h → boat speed = (10+5)/2 = 7.5 km/h."
    },
    {
      "id": 27,
      "category": "Interview (Stress Test)",
      "problem": "“If we reject you today, what will you do?”",
      "expert_answer": "Show resilience: “I’ll reflect, improve my skills, and reapply when I’m stronger. Rejection motivates me to grow.”"
    },
    {
      "id": 28,
      "category": "Deep Puzzle",
      "problem": "Four people must cross a bridge at night with one torch. They take 1, 2, 7, and 10 mins. Only two can cross at once. What’s the minimum time?",
      "expert_answer": "Optimal = 17 mins (Strategy: 1+2 cross, 1 returns, 7+10 cross, 2 returns, 1+2 cross again)."
    },
    {
      "id": 29,
      "category": "Workplace Problem (Critical)",
      "problem": "You realize a project will fail just days before deadline. What do you do?",
      "expert_answer": "Communicate early, propose salvage strategy (partial delivery, phased approach), and ensure transparency."
    },
    {
      "id": 30,
      "category": "Final Brain Teaser",
      "problem": "You have 2 eggs and a 100-floor building. Find the highest floor from which you can drop an egg without breaking. Minimize attempts.",
      "expert_answer": "Use √N strategy → first egg from floors 14, 27, 39… until it breaks. Then use second egg floor by floor. Worst-case = 14 attempts."
    }
  ]
}
